Revit 2027 API
ParameterTypeId.IfcSiteGuid Property
 "IfcSite GUID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcSiteGuid { get; }
Public Shared ReadOnly Property IfcSiteGuid As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcSiteGuid {
	ForgeTypeId^ get ();
}
static member IfcSiteGuid : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace